---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarHandlePositionData
source: html/a234ea1c-bd46-ea33-5382-38a9cfea7587.htm
---
# RebarHandlePositionData Methods

Returns the geometry for a bar at the specified index currently in the Rebar.